//
//  File.swift
//  Navigation1.3
//
//  Created by Artyom Potapov on 06.03.2022.
//

import Foundation

let post1 = PostModel(author: "ТАСС", description: "Для доставки грузов в Калининградскую область задействуют международный аэропорт «Храброво» и паромную линию «Балтийск – Усть-Луга», сообщает информагентство ТАСС.", image: "scale_2400", likes: 123, views: 321)

let post2 = PostModel(author: "МЧС по Ленобласти", description: "В понедельник, 7 марта, в Ленинградской области ожидается облачная, днём с прояснениями, погода. Ночью в большинстве районов, а также днём пройдут небольшие снегопады, сообщили «Форпосту» в областном управлении МЧС. Столбик термометра ночью покажет от -2 до -7 градусов, местами до -10. Днём потеплеет – температура воздуха составит от -6 до -1 градуса.", image: "branches-5994417_960_720", likes: 111, views: 55)
let post3 = PostModel(author: "Полякова Татьяна", description: "Однажды Аня меня спросила: «Назови три города, которые любишь больше всех?». Я сразу отвечаю: «Рим, Барселона…» Насчет третьего задумалась. После двух встреч с Ярославлем, мне хочется еще приехать и посмотреть то, и то, и то. И снова обойти храмы, в которых я была, и побывать в тех, где я не была, и полюбоваться Волгой с прекрасной набережной и прогуляться по набережной Которосли. Теперь поняла: третий мой любимый город — Ярославль. И я мечтаю о новой встрече с ним.", image: "870_635_fixedwidth", likes: 5, views: 12)

let post4 = PostModel(author: "ZAVODFOTO.RU", description: "На полях Красноярского экономического форума стало известно, что компания «Норильский никель» планирует приступить к строительству новой обогатительной фабрики на севере Красноярского края в рамках проекта «Южный кластер» уже в 2023 году. Её мощность составит 18 млн тонн руд в год. Общий объем инвестиций в реализацию проекта по развитию кластера составит 90 млрд рублей.", image: "scale_1200", likes: 33, views: 228)

let posts = [post1, post2, post3, post4]
